Backend/app/controllers/api/v1/ideas_controller.rb

    def index
      @ideas = Idea.order("created_at DESC")
---
SELECT "ideas".* FROM "ideas" ORDER BY created_at DESC

    def create
      @idea = Idea.create(idea_params)
---
INSERT INTO "ideas" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New title"], ["body", "New body"], ["created_at", "2020-01-03 11:56:05.355664"], ["updated_at", "2020-01-03 11:56:05.355664"]]

    def update
      @idea = Idea.find(params[:id])
      @idea.update_attributes(idea_params)
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "ideas" SET "body" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["body", "Hello "], ["updated_at", "2020-01-03 12:53:54.218883"], ["id", 13]]

    def destroy
      @idea = Idea.find(params[:id])
      if @idea.destroy
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 24]]